
 make.py started: 2017-04-24 12:54:29 /Users/leviboxell/Desktop/gslab_mde 



 get_externals.py started: 2017-04-24 12:54:29 /Users/leviboxell/Desktop/gslab_mde

 Input was: "35720	%svn%/lib/third_party/matlab_xunit/	*	/matlab_xunit/	""""".
SVN command passed: https://econ-gentzkow-svn.stanford.edu/repos/main/trunk/lib/third_party/matlab_xunit/ @35720 exported to ./external/matlab_xunit/.

 Input was: "35720	%svn%/lib/stata/gslab_misc/ado/	*	/gslab_misc/	""""".
SVN command passed: https://econ-gentzkow-svn.stanford.edu/repos/main/trunk/lib/stata/gslab_misc/ado/ @35720 exported to ./external/gslab_misc/.

 Input was: "35720	%svn%/lib/matlab/gslab_model/data	*	/data/	""""".
SVN command passed: https://econ-gentzkow-svn.stanford.edu/repos/main/trunk/lib/matlab/gslab_model/data/ @35720 exported to ./external/data/.

 get_externals.py ended: 2017-04-24 12:54:33

 get_externals.py started: 2017-04-24 12:54:33 /Users/leviboxell/Desktop/gslab_mde
Note: not using filename externals.txt.


 Input was: "35000	%svn%/lib/c/gslab_misc/	*	/gslab_misc_c/	""""".
SVN command passed: https://econ-gentzkow-svn.stanford.edu/repos/main/trunk/lib/c/gslab_misc/ @35000 exported to ./depend/gslab_misc_c/.

 Input was: "35090	%svn%/lib/matlab/gslab_misc/	*	/gslab_misc/	""""".
SVN command passed: https://econ-gentzkow-svn.stanford.edu/repos/main/trunk/lib/matlab/gslab_misc/ @35090 exported to ./depend/gslab_misc/.

 Input was: "35000	%svn%/lib/matlab/numerical_derivatives/	*	/numerical_derivatives/	""""".
SVN command passed: https://econ-gentzkow-svn.stanford.edu/repos/main/trunk/lib/matlab/numerical_derivatives/ @35000 exported to ./depend/numerical_derivatives/.

 Input was: "35000	%svn%/lib/third_party/nwspgr/	*	/nwspgr/	""""".
SVN command passed: https://econ-gentzkow-svn.stanford.edu/repos/main/trunk/lib/third_party/nwspgr/ @35000 exported to ./depend/nwspgr/.

 Input was: "35000	%svn%/lib/matlab/gslab_model/	*	/gslab_model/	""""".
SVN command passed: https://econ-gentzkow-svn.stanford.edu/repos/main/trunk/lib/matlab/gslab_model/ @35000 exported to ./depend/gslab_model/.

 get_externals.py ended: 2017-04-24 12:54:38


Execute:  statamp -e do "output_for_test_against_stata.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.2   Copyright 1985-2015 StataCorp LP
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Unlimited-user 4-core Stata network license expires 21 Jul 2017:
       Serial number:  501409012939
         Licensed to:  Economics
                       Stanford University

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running /Applications/Stata/profile.do ...

. do output_for_test_against_stata.do 

.  /**********************************************************
>  *
>  *  OUTPUT_FOR_TEST_AGAINST_STATA.DO
>  * 
>  **********************************************************/ 
. 
. version 12

. set more off

. adopath + ../external/gslab_misc
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "~/Library/Application Support/Stata/ado/personal/"
  [5]  (PLUS)      "~/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "../external/gslab_misc"

. preliminaries

. 
. program main
  1.     import_raw_data, obs(100)
  2.     run_linear_gmm
  3.     run_linear_gmm_with_instr
  4. end

. 
. program import_raw_data
  1.     syntax, obs(int)
  2.     insheet using "../external/data/test_data.csv", clear
  3.     drop if _n > `obs'
  4. end

. 
. program run_linear_gmm 
  1.     gmm (y_norm - {b0} - {xb: x1 x2}), instr(x1 x2) onestep 
  2.     matrix parammat = e(b)
  3.     matrix vcovmat = e(V)
  4.     local outfile stataout_linear.txt
  5.     matrix_to_txt, matrix(parammat) saving(parammat_`outfile') format(%19.0g) replace
  6.     matrix_to_txt, matrix(vcovmat) saving(vcovmat_`outfile') format(%19.0g) replace
  7. end

. 
. 
. program run_linear_gmm_with_instr
  1.     gmm (y_norm - {b0} - {b1}*x1), instr(x3 x4) onestep 
  2.     matrix parammat = e(b)
  3.     matrix vcovmat = e(V)
  4.     matrix wmat = e(W)
  5.     local outfile stataout_linear_instr.txt
  6.     matrix_to_txt, matrix(parammat) saving(parammat_`outfile') format(%19.0g) replace
  7.     matrix_to_txt, matrix(vcovmat) saving(vcovmat_`outfile') format(%19.0g) replace
  8.     matrix_to_txt, matrix(wmat) saving(wmat_`outfile') format(%19.0g) replace
  9. end

. 
. main
(8 vars, 100,000 obs)
(99,900 observations deleted)

Step 1
Iteration 0:   GMM criterion Q(b) =  102.56023  
Iteration 1:   GMM criterion Q(b) =  6.404e-24  
Iteration 2:   GMM criterion Q(b) =  5.796e-32  

note: model is exactly identified

GMM estimation 

Number of parameters =   3
Number of moments    =   3
Initial weight matrix: Unadjusted                 Number of obs   =        100

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         /b0 |   9.418119   .3233264    29.13   0.000     8.784411    10.05183
      /xb_x1 |   .3767902   .3877958     0.97   0.331    -.3832757    1.136856
      /xb_x2 |   .9283564   .3849662     2.41   0.016     .1738366    1.682876
------------------------------------------------------------------------------
Instruments for equation 1: x1 x2 _cons
(note: file parammat_stataout_linear.txt not found)
(note: file vcovmat_stataout_linear.txt not found)

Step 1
Iteration 0:   GMM criterion Q(b) =  102.50933  
Iteration 1:   GMM criterion Q(b) =  .00072043  
Iteration 2:   GMM criterion Q(b) =  .00072043  

GMM estimation 

Number of parameters =   2
Number of moments    =   3
Initial weight matrix: Unadjusted                 Number of obs   =        100

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         /b0 |   8.191374   1.421534     5.76   0.000     5.405219    10.97753
         /b1 |   3.481789    2.54383     1.37   0.171    -1.504026    8.467605
------------------------------------------------------------------------------
Instruments for equation 1: x3 x4 _cons
(note: file parammat_stataout_linear_instr.txt not found)
(note: file vcovmat_stataout_linear_instr.txt not found)
(note: file wmat_stataout_linear_instr.txt not found)

. 
. 
end of do-file


Execute:  matlab -r run_all_tests -logfile run_all_tests.log -nosplash -nodesktop
[?1h=
                                                                < M A T L A B (R) >
                                                      Copyright 1984-2016 The MathWorks, Inc.
                                                       R2016b (9.1.0.441655) 64-bit (maci64)
                                                                 September 7, 2016

 
To get started, type one of these: helpwin, helpdesk, or demo.
For product information, visit www.mathworks.com.
 
Test suite: test
Test suite location: /Users/leviboxell/Desktop/gslab_mde/test/../test
24-Apr-2017 12:54:50

Starting test run with 1 test case.

=======================================
          Commercial License
         Artelys Knitro 10.1.1
=======================================

Knitro presolve eliminated 0 variables and 0 constraints.

algorithm:            1
gradopt:              4
hessopt:              2
honorbnds:            1
maxit:                10000
opttol:               1e-10
outlev:               1
par_concurrent_evals: 0
xtol:                 1e-20
The problem is identified as unconstrained.
Knitro changing bar_initpt from AUTO to 3.
Knitro changing bar_murule from AUTO to 4.
Knitro changing bar_penaltycons from AUTO to 1.
Knitro changing bar_penaltyrule from AUTO to 2.
Knitro changing bar_switchrule from AUTO to 1.
Knitro changing linsolver from AUTO to 2.

Problem Characteristics                    ( Presolved)
-----------------------
Objective goal:  Minimize
Number of variables:                     3 (         3)
    bounded below:                       0 (         0)
    bounded above:                       0 (         0)
    bounded below and above:             0 (         0)
    fixed:                               0 (         0)
    free:                                3 (         3)
Number of constraints:                   0 (         0)
    linear equalities:                   0 (         0)
    nonlinear equalities:                0 (         0)
    linear inequalities:                 0 (         0)
    nonlinear inequalities:              0 (         0)
    range:                               0 (         0)
Number of nonzeros in Jacobian:          0 (         0)
Number of nonzeros in Hessian:           6 (         6)

EXIT: Primal feasible solution; terminate because the relative change in
      the objective function < 1.000000e-15 for 5 consecutive feasible iterations.
      Decrease ftol or increase ftol_iters to try for more accuracy.

Final Statistics
----------------
Final objective value               =   1.99710071742668e-14
Final feasibility error (abs / rel) =   0.00e+00 / 0.00e+00
Final optimality error  (abs / rel) =   4.30e-08 / 4.30e-08
# of iterations                     =         19 
# of CG iterations                  =         22 
# of function evaluations           =        128
# of gradient evaluations           =          0
Total program time (secs)           =       0.28040 (     0.232 CPU time)
Time spent in evaluations (secs)    =       0.13346

===============================================================================


=======================================
          Commercial License
         Artelys Knitro 10.1.1
=======================================

Knitro presolve eliminated 0 variables and 0 constraints.

algorithm:            1
gradopt:              4
hessopt:              2
honorbnds:            1
maxit:                10000
opttol:               1e-10
outlev:               1
par_concurrent_evals: 0
xtol:                 1e-20
The problem is identified as unconstrained.
Knitro changing bar_initpt from AUTO to 3.
Knitro changing bar_murule from AUTO to 4.
Knitro changing bar_penaltycons from AUTO to 1.
Knitro changing bar_penaltyrule from AUTO to 2.
Knitro changing bar_switchrule from AUTO to 1.
Knitro changing linsolver from AUTO to 2.

Problem Characteristics                    ( Presolved)
-----------------------
Objective goal:  Minimize
Number of variables:                     2 (         2)
    bounded below:                       0 (         0)
    bounded above:                       0 (         0)
    bounded below and above:             0 (         0)
    fixed:                               0 (         0)
    free:                                2 (         2)
Number of constraints:                   0 (         0)
    linear equalities:                   0 (         0)
    nonlinear equalities:                0 (         0)
    linear inequalities:                 0 (         0)
    nonlinear inequalities:              0 (         0)
    range:                               0 (         0)
Number of nonzeros in Jacobian:          0 (         0)
Number of nonzeros in Hessian:           3 (         3)

EXIT: Locally optimal solution found.

Final Statistics
----------------
Final objective value               =   7.20426313649706e-04
Final feasibility error (abs / rel) =   0.00e+00 / 0.00e+00
Final optimality error  (abs / rel) =   7.73e-11 / 7.73e-11
# of iterations                     =          8 
# of CG iterations                  =          0 
# of function evaluations           =         31
# of gradient evaluations           =          0
Total program time (secs)           =       0.02221 (     0.033 CPU time)
Time spent in evaluations (secs)    =       0.01919

===============================================================================

.
PASSED in 2.364 seconds.
[?1l>
                                                                < M A T L A B (R) >
                                                      Copyright 1984-2016 The MathWorks, Inc.
                                                       R2016b (9.1.0.441655) 64-bit (maci64)
                                                                 September 7, 2016

 
To get started, type one of these: helpwin, helpdesk, or demo.
For product information, visit www.mathworks.com.
 
Test suite: test
Test suite location: /Users/leviboxell/Desktop/gslab_mde/test/../test
24-Apr-2017 12:54:50

Starting test run with 1 test case.

=======================================
          Commercial License
         Artelys Knitro 10.1.1
=======================================

Knitro presolve eliminated 0 variables and 0 constraints.

algorithm:            1
gradopt:              4
hessopt:              2
honorbnds:            1
maxit:                10000
opttol:               1e-10
outlev:               1
par_concurrent_evals: 0
xtol:                 1e-20
The problem is identified as unconstrained.
Knitro changing bar_initpt from AUTO to 3.
Knitro changing bar_murule from AUTO to 4.
Knitro changing bar_penaltycons from AUTO to 1.
Knitro changing bar_penaltyrule from AUTO to 2.
Knitro changing bar_switchrule from AUTO to 1.
Knitro changing linsolver from AUTO to 2.

Problem Characteristics                    ( Presolved)
-----------------------
Objective goal:  Minimize
Number of variables:                     3 (         3)
    bounded below:                       0 (         0)
    bounded above:                       0 (         0)
    bounded below and above:             0 (         0)
    fixed:                               0 (         0)
    free:                                3 (         3)
Number of constraints:                   0 (         0)
    linear equalities:                   0 (         0)
    nonlinear equalities:                0 (         0)
    linear inequalities:                 0 (         0)
    nonlinear inequalities:              0 (         0)
    range:                               0 (         0)
Number of nonzeros in Jacobian:          0 (         0)
Number of nonzeros in Hessian:           6 (         6)

EXIT: Primal feasible solution; terminate because the relative change in
      the objective function < 1.000000e-15 for 5 consecutive feasible iterations.
      Decrease ftol or increase ftol_iters to try for more accuracy.

Final Statistics
----------------
Final objective value               =   1.99710071742668e-14
Final feasibility error (abs / rel) =   0.00e+00 / 0.00e+00
Final optimality error  (abs / rel) =   4.30e-08 / 4.30e-08
# of iterations                     =         19 
# of CG iterations                  =         22 
# of function evaluations           =        128
# of gradient evaluations           =          0
Total program time (secs)           =       0.28040 (     0.232 CPU time)
Time spent in evaluations (secs)    =       0.13346

===============================================================================


=======================================
          Commercial License
         Artelys Knitro 10.1.1
=======================================

Knitro presolve eliminated 0 variables and 0 constraints.

algorithm:            1
gradopt:              4
hessopt:              2
honorbnds:            1
maxit:                10000
opttol:               1e-10
outlev:               1
par_concurrent_evals: 0
xtol:                 1e-20
The problem is identified as unconstrained.
Knitro changing bar_initpt from AUTO to 3.
Knitro changing bar_murule from AUTO to 4.
Knitro changing bar_penaltycons from AUTO to 1.
Knitro changing bar_penaltyrule from AUTO to 2.
Knitro changing bar_switchrule from AUTO to 1.
Knitro changing linsolver from AUTO to 2.

Problem Characteristics                    ( Presolved)
-----------------------
Objective goal:  Minimize
Number of variables:                     2 (         2)
    bounded below:                       0 (         0)
    bounded above:                       0 (         0)
    bounded below and above:             0 (         0)
    fixed:                               0 (         0)
    free:                                2 (         2)
Number of constraints:                   0 (         0)
    linear equalities:                   0 (         0)
    nonlinear equalities:                0 (         0)
    linear inequalities:                 0 (         0)
    nonlinear inequalities:              0 (         0)
    range:                               0 (         0)
Number of nonzeros in Jacobian:          0 (         0)
Number of nonzeros in Hessian:           3 (         3)

EXIT: Locally optimal solution found.

Final Statistics
----------------
Final objective value               =   7.20426313649706e-04
Final feasibility error (abs / rel) =   0.00e+00 / 0.00e+00
Final optimality error  (abs / rel) =   7.73e-11 / 7.73e-11
# of iterations                     =          8 
# of CG iterations                  =          0 
# of function evaluations           =         31
# of gradient evaluations           =          0
Total program time (secs)           =       0.02221 (     0.033 CPU time)
Time spent in evaluations (secs)    =       0.01919

===============================================================================

.
PASSED in 2.364 seconds.

 make.py ended: 2017-04-24 12:54:55
